In [2]:
import pandas as pd
import numpy as np
data = {'name': ['Alice', 'Bob', 'Charlie', 'Dave'],
        'age': [25, 35, 40, 28],
        'gender': ['F', 'M', 'M', 'M'],
        'salary': [50000, 70000, 60000, 80000]}

df = pd.DataFrame(data)

In [3]:
df

      name  age gender  salary
0    Alice   25      F   50000
1      Bob   35      M   70000
2  Charlie   40      M   60000
3     Dave   28      M   80000

In [4]:
age_data = df[df['age']>30]

In [5]:
age_data

      name  age gender  salary
1      Bob   35      M   70000
2  Charlie   40      M   60000

In [11]:
name_data = df[df['name'].str.contains('e')]

In [12]:
name_data

      name  age gender  salary
0    Alice   25      F   50000
2  Charlie   40      M   60000
3     Dave   28      M   80000

In [16]:
d = df[(df['gender'] == 'M') & (df['salary'] > 65000)]
d

   name  age gender  salary
1   Bob   35      M   70000
3  Dave   28      M   80000

In [19]:
se = df[['name','age']]

In [20]:
se

      name  age
0    Alice   25
1      Bob   35
2  Charlie   40
3     Dave   28